// Подключить функции из файла sudoku.js.
const sudoku = require('./sudoku');

function readAndSolve(error, fileData) {
  // Если чтение файла не удалось, выбросить ошибку с описанием проблемы и
  // завершить работу функции.
  if (error) {
    throw error;
  }

  // Разбить содержимое файла построчно и отфильтровать все пустые строки.
  const puzzles = fileData
    .split('\n')
    .filter((line) => line !== '');

  // Получить номер судоку из process.argv, либо взять 1-й судоку по умолчанию.
  let puzzleNumber = Number(process.argv[2]) || 1;

  // Ограничить номер судоку максимальным числом массива с паззлами.
  if (puzzleNumber > puzzles.length) {
    puzzleNumber = puzzles.length;
  }

  // Получить желаемый судоку по индексу и вывести его в консоль..
  const puzzle = puzzles[puzzleNumber - 1];
  console.log('\n',`ᖘᙓᗯᗣᙓᗰ ᙅᎽᗪᗝᏦᎽ №${puzzleNumber}:`, '\n');
  console.log(puzzle, '\n');

  // Использовать функцию solve из файла sudoku.js для решения судоку.
  const solvedPuzzle = sudoku.solve(puzzle);

  // Использовать функцию isSolved из файла sudoku.js для проверки решения судоку.
  if (!sudoku.isSolved(solvedPuzzle)) {
    console.log(`ᕼᙓ ᙅᗰᗝᒋᙁᑌ ᖘᙓᗯᑌᙢᖚ ᙅᎽᗪᗝᏦᎽ №${puzzleNumber} 🤬🤬🤬😤`, '\n');
    return; // Если судоку не решён, завершить работу этой функции.
  }

  // Код ниже сработает, только если проверка решения судоку прошла успешно.
  console.log(`ᙅᎽᗪᗝᏦᎽ №${puzzleNumber} рᖘᙓᗯᕧᕼ Ꮍᙅᑎᙓᗯᕼᗝ! 😄😄😄`, '\n');

  // Использовать функцию prettyBoard из файла sudoku.js для форматирования
  // игрового поля в строку в желаемом формате.
  
  // console.log(sudoku.prettyBoard(solvedPuzzle), '\n');
  sudoku.prettyBoard(solvedPuzzle)
}

module.exports = readAndSolve;
